# -*- coding: utf-8 -*-

# Игра «Быки и коровы»
# https://goo.gl/Go2mb9
#
# Правила:
# Компьютер загадывает четырехзначное число, все цифры которого различны
# (первая цифра числа отлична от нуля). Игроку необходимо разгадать задуманное число.
# Игрок вводит четырехзначное число c неповторяющимися цифрами,
# компьютер сообщают о количестве «быков» и «коров» в названном числе
# «бык» — цифра есть в записи задуманного числа и стоит в той же позиции,
#       что и в задуманном числе
# «корова» — цифра есть в записи задуманного числа, но не стоит в той же позиции,
#       что и в задуманном числе
#
# Например, если задумано число 3275 и названо число 1234,
# получаем в названном числе одного «быка» и одну «корову».
# Очевидно, что число отгадано в том случае, если имеем 4 «быка».
#
# Формат ответа компьютера
# > быки - 1, коровы - 1


# Составить отдельный модуль mastermind_engine, реализующий функциональность игры.
# В этом модуле нужно реализовать функции:
#   загадать_число()
#   проверить_число(NN) - возвращает словарь {'bulls': N, 'cows': N}
# Загаданное число хранить в глобальной переменной.
# Обратите внимание, что строки - это список символов.
#
# В текущем модуле (lesson_006/01_mastermind.py) реализовать логику работы с пользователем:
#   модуль движка загадывает число
#   в цикле, пока число не отгадано
#       у пользователя запрашивается вариант числа
#       модуль движка проверяет число и выдает быков/коров
#       результат быков/коров выводится на консоль
#  когда игрок угадал таки число - показать количество ходов и вопрос "Хотите еще партию?"
#
# При написании кода учитывайте, что движок игры никак не должен взаимодействовать с пользователем.
# Все общение с пользователем делать в текущем модуле. Представьте, что движок игры могут использовать
# разные клиенты - веб, чатбот, приложение, етс - они знают как спрашивать и отвечать пользователю.
# Движок игры реализует только саму функциональность игры.
# Это пример применения SOLID принципа (см https://goo.gl/GFMoaI) в архитектуре программ.
# Точнее, в этом случае важен принцип единственной ответственности - https://goo.gl/rYb3hT

# TODO здесь ваш код...
import mastermind_engine as me


def user_answer(answer):
    if answer == 'yes' or answer == 'YES':
        me.target_number()
        game()
    elif answer == 'no' or answer == 'NO':
        print('Goodbye')
    else:
        answer = input('\nPlease type again: \n')
        user_answer(answer)


def start_game():
    action = input('Let start GAME? \n Type YES or NO \n')
    user_answer(action)


def game():
    user_attempts = 0
    while True:
        user_number = input('Enter your four-digit number:')
        if user_number.isnumeric():
            if len(user_number) != 4:
                print('Try again, enter your four-digit number:')
                continue
            else:
                checker = me.check_number(user_number)
                print('Bulls:', checker['bulls'], 'Cows:', checker['cows'])
        else:
            print('Try again, enter your four-digit number:')
            continue

        user_attempts += 1

        if me.check_result(checker['bulls']):
            break

    print('You made {} attempts'.format(user_attempts))

    user_start_again = input('Play again? \n Type YES or NO \n')

    user_answer(user_start_again)


start_game()
