# -*- coding: utf-8 -*-

# Игра «Быки и коровы»
# https://goo.gl/Go2mb9
#
# Правила:
# Компьютер загадывает четырехзначное число, все цифры которого различны
# (первая цифра числа отлична от нуля). Игроку необходимо разгадать задуманное число.
# Игрок вводит четырехзначное число c неповторяющимися цифрами,
# компьютер сообщают о количестве «быков» и «коров» в названном числе
# «бык» — цифра есть в записи задуманного числа и стоит в той же позиции,
#       что и в задуманном числе
# «корова» — цифра есть в записи задуманного числа, но не стоит в той же позиции,
#       что и в задуманном числе
#
# Например, если задумано число 3275 и названо число 1234,
# получаем в названном числе одного «быка» и одну «корову».
# Очевидно, что число отгадано в том случае, если имеем 4 «быка».
#
# Формат ответа компьютера
# > быки - 1, коровы - 1


# Составить отдельный модуль mastermind_engine, реализующий функциональность игры.
# В этом модуле нужно реализовать функции:
#   загадать_число()
#   проверить_число(NN) - возвращает словарь {'bulls': N, 'cows': N}
# Загаданное число хранить в глобальной переменной.
# Обратите внимание, что строки - это список символов.
#
# В текущем модуле (lesson_006/01_mastermind.py) реализовать логику работы с пользователем:
#   модуль движка загадывает число
#   в цикле, пока число не отгадано
#       у пользователя запрашивается вариант числа
#       модуль движка проверяет число и выдает быков/коров
#       результат быков/коров выводится на консоль
#  когда игрок угадал таки число - показать количество ходов и вопрос "Хотите еще партию?"
#
# При написании кода учитывайте, что движок игры никак не должен взаимодействовать с пользователем.
# Все общение с пользователем делать в текущем модуле. Представьте, что движок игры могут использовать
# разные клиенты - веб, чатбот, приложение, етс - они знают как спрашивать и отвечать пользователю.
# Движок игры реализует только саму функциональность игры.
# Это пример применения SOLID принципа (см https://goo.gl/GFMoaI) в архитектуре программ.
# Точнее, в этом случае важен принцип единственной ответственности - https://goo.gl/rYb3hT

# TODO здесь ваш код...
import mastermind_engine as me

me.target_number()


def start_game():
    action = input('Let start GAME? \n Type YES or NO \n')
    if action == 'yes' or action == 'YES':
        game()
    elif action == 'no' or action == 'NO':
        print('Goodbye')
    else:
        start_game()


def game():
    user_attempts = 0
    bulls = 0
    while bulls != 4:
        user_number = input('Enter your four-digit number:')
        if user_number.isnumeric():
            checker = me.check_number(user_number)
            print('Bulls:', checker['bulls'], 'Cows:', checker['cows'])
        else:
            print('Try again, enter your four-digit number:')

        user_attempts += 1

        bulls = checker['bulls']

    print('You made {} attempts'.format(user_attempts))

    user_start_again = input('Play again? \n Type YES or NO \n')

    if user_start_again == 'yes' or user_start_again == 'YES':
        game()
    elif user_start_again == 'no' or user_start_again == 'NO':
        print('Goodbye')
    else:
        start_game()


start_game()
